cpmatch_app_api/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "blurb", "genre", "username", "contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    if @post.save